{
    "A":[
        {
            "term": "Address",
            "description": "Can also be called 'Wallet Address'. An Address is a virtual location where the cryptocurrency can be sent. It is a unique alphanumeric character string that defines the transactions made on a blockchain network."
        },
        {
            "term": "Airdrop",
            "description": "Represents a marketing process with the purpose of promoting a new virtual currency. The process involves sending tokens or coins to various Wallet Addresses."
        },
        {
            "term": "Algorithm",
            "description": "An algorithm is a set of rules designed to perform a specific task, regardless if it is a simple or complex process."
        },
        {
            "term": "All or None Order (AON)",
            "description": "A type of order different from e.g. a market order. This order is made on a financial exchange to buy or sell assets for a certain price, and must be either completely filled or not at all."
        },
        {
            "term": "All-Time High (ATH)",
            "description": "Represents the highest price reached by a digital currency or equity on a specific exchange."
        },
        {
            "term": "Allocation",
            "description": "Represents the distribution of tokens or equity, no matter if they are earned, purchased, etc."
        },
        {
            "term": "Altcoin",
            "description": "A generic name given to all other cryptocurrencies that are not Bitcoin (the first cryptocurrency)."
        },
        {
            "term": "Anti Money Laundering (AML)",
            "description": "A process through which laws and regulations prevent the illegal making or moving of funds, assets and/or money."
        },
        {
            "term": "API",
            "description": "Stands for Application Programming Interface and represents a set of functions and protocols which build and integrate application software. An API defines various calls or requests that can be made, how to make them, the data formats that should be used, etc."
        },
        {
            "term": "API Gateway",
            "description": "An API Gateway is an API connection between a client and a specific backend service/services. It receives API calls, processes them by gathering the services needed to fulfill them, and returns the appropriate result (positive or negative)."
        },
        {
            "term": "API Key",
            "description": "An API key is a unique identifier passed to an API in order to identify the specific software that is making the call. API keys are used to track how one API is being used. A user requires an API key to make the API call in the first place."
        },
        {
            "term": "API Limiting/ Rate Limiting",
            "description": "API limiting, also known as 'Rate Limiting', or sometimes 'Application Rate Limiting', is a process which limits the requests sent from an API, with the purpose of preventing the API from being overloaded. It is a main security measure against system errors, performance issues and DoS attacks."
        },
        {
            "term": "Arbitrage",
            "description": "A process where a user takes advantage of an asset's varying prices on different markets, by purchasing and selling that same asset over and over again for a specific period of time."
        },
        {
            "term": "ASIC",
            "description": "Stands for Application-specific integrated circuit. This is an integrated circuit chip dedicated to specifically reaching maximum performance for a particular use, rather than being generically used. Used for better mining of cryptocurrencies than using a traditional GPU."
        },
        {
            "term": "ASIC-resistant",
            "description": "A cryptocurrency that is mining-resistant towards dedicated (ASIC) machines."
        },
        {
            "term": "Asset Management",
            "description": "Represents the business method of managing assets - directly or on the behalf of a client."
        },
        {
            "term": "Asynchronous",
            "description": "Processes that don’t occur simultaneously and happen independently of the basic program flow."
        },
        {
            "term": "Atomic Swap",
            "description": "Smart contracts that ensure users exchange their cryptocurrencies for other without the need of using a centralized exchange."
        },
        {
            "term": "Authentication",
            "description": "Authentication is the process of a system recognizing and proving a user's identity, in order for them to use that specific software/service/API."
        },
        {
            "term": "Authorization",
            "description": "Defines the function of specifying system access rights and privileges not to users, but rather resources, such as services, computer programs, data and application features."
        }
    ],
    "B":[
        {
            "term": "Bag",
            "description": "The entirety of coins and tokens a user possesses. Usually refers to an amount of a single cryptocurrency. The amount has no minimum, though if it is too high it can be referred to as 'heavy bags'."
        },
        {
            "term": "Bear Market",
            "description": "When prices on the crypto market follow negative trends."
        },
        {
            "term": "Benchmark",
            "description": "A standard point of reference to analyze and see advantages and disadvantages of similar products."
        },
        {
            "term": "Bitcoin",
            "description": "The first ever cryptocurrency, invented in 2008 and implemented as open-source software in 2009. It was created by an anonymous person known only as Satoshi Nakamoto."
        },
        {
            "term": "Bitcoin Cash (BCH)",
            "description": "A cryptocurrency that stemmed from Bitcoin in 2017, i.e. an altcoin of Bitcoin. It was created by miners and developers who initiated a 'hard fork'. BCH includes an increased block size of 8 MB which enables more transactions to be processed, as well as increases scalability. In November 2018 BCH was split into Bitcoin Cash ABC, now known only as Bitcoin Cash, and Bitcoin Cash SV (Satoshi Vision)."
        },
        {
            "term": "Bitcoin Core",
            "description": "The main implementation of the software allowing people to actually be able to use the Bitcoin network."
        },
        {
            "term": "Bitcoin Dominance",
            "description": "Represents Bitcoin's market value as compared to all other cryptocurrency markets."
        },
        {
            "term": "Bitcoin Pizza",
            "description": "The first ever known transaction of Bitcoin for physical goods, which was done in May 2010 by a programmer named Laszlo Hanyecz who paid 10 000 BTC for two pizzas. The Bitcoin back then was valued at about USD 41."
        },
        {
            "term": "Bitcoin Vault (BTCV) ",
            "description": "T Bitcoin Vault is a cryptocurrency based on Bitcoin Core and created in December 2019. It provides an additional level of security which is based on a three-private-key structure. It includes all advantages of Bitcoin while at the same time adds new features such as the user ability to cancel transactions, send Secure payments, etc."
        },
        {
            "term": "Block/ Transaction block ",
            "description": "The Block is an essential part of the blockchain. Each block contains a cryptographic hash of the previous block, a timestamp, and transaction data. It basically acts as a ledger where its purpose is to record the most recent unentered Bitcoin transactions. Every new block is connected to the previous completed one."
        },
        {
            "term": "Block explorer",
            "description": "A specific online tool used to check past or current transactions on a specific blockchain. It provides further details such as transaction growth and network hash rate and users can browse through it."
        },
        {
            "term": "Block header",
            "description": "A section in the block that contains its metadata and a summary of its transactions with the purpose to identify that specific block on the blockchain. It is repeatedly hashed to create Proof of Work (PoW) for mining rewards."
        },
        {
            "term": "Block height/ Height ",
            "description": "The block height of a particular block is defined as the number of blocks preceding it in the blockchain starting from the genesis block."
        },
        {
            "term": "Block reward",
            "description": "The entirety of coins granted by the blockchain protocol as a reward to miners for each mined and validated block."
        },
        {
            "term": "Blockchain",
            "description": "Represents a digital decentralized ledger consisting of various blocks that are used to store information related to transactions which occur on a blockchain network."
        },
        {
            "term": "Blockchain protocol ",
            "description": "The rules that govern a blockchain network are known as 'Blockchain protocol'. It is essentially the common communication rules that the network operates by."
        },
        {
            "term": "Bloom Filter",
            "description": "Represents a data structure used to inform the user whether a particular item is part of a set, or more accurately - inform with certainty if it is not part of a set. In some cryptocurrencies (mostly Bitcoin), the Bloom filter is essential for the Simplified Payment Verification (SPV)."
        },
        {
            "term": "BNB",
            "description": "A cryptocurrency token created by Binance in 2017. BNB was initially issued as an ERC-20 token."
        },
        {
            "term": "Bounty",
            "description": "A posted incentive with the purpose of boosting a particular activity, conduct or advancement."
        },
        {
            "term": "Breakeven Point (BEP) ",
            "description": "The point where the total cost and the revenue are both equal."
        },
        {
            "term": "Breakeven multiple ",
            "description": "Represents by how much a coin or asset needs to be multiplied by in order to reach its Breakeven Point (BEP)."
        },
        {
            "term": "Bull Market",
            "description": "When prices on the crypto market follow positive trends."
        },
        {
            "term": "Buy Wall",
            "description": "Represents one large purchase order or the compilation of multiple big purchase orders that are on the same price in an order book of a particular market. Buy walls basically prevents the dropping of market prices as such massive amounts of orders require large amounts of money to be paid/transferred."
        }
    ],
    "C":[
        {
            "term": "Candidate Block",
            "description": "Represents a block a miner is in the process of mining in order to receive the block reward. Can also be known as 'temporary block'. It can be eventually either validated or discarded by the network."
        },
        {
            "term": "Call/ API call",
            "description": "When a request from an endpoint is made to an application's server. Through this call information is transferred, processed, and a reply is returned."
        },
        {
            "term": "Callback",
            "description": "A function that is activated after another one completes. E.g. receiving notifications on events. A callback requires a callback URL to be set."
        },
        {
            "term": "Callback URL",
            "description": "A URL set upfront where the callback notification will be received, when it's time."
        },
        {
            "term": "Censorship-resistance",
            "description": "Refers to the property of a cryptocurrency network and dictates that any user can make transactions on the network, as long as they follow the rules set by the protocol, and they cannot modify any already existing transactions."
        },
        {
            "term": "Centralized",
            "description": "A concept of data and network distribution where these are governed by a single (centralized) entity (server, computer, etc.). Such a centralized system/network always needs a main controlling mechanism, otherwise it cannot operate properly."
        },
        {
            "term": "Cipher",
            "description": "Can also be seen as 'Cypher'. A method used in the encryption and decryption of values, which can be done either asymmetrically or symmetrically depending on the key type."
        },
        {
            "term": "Circulating Supply ",
            "description": "The number of all crypto coins and tokens that are publicly available and circulating on the market."
        },
        {
            "term": "Client",
            "description": "A computer/program that sends a request to another program/hardware/software that accesses a service made available by a server"
        },
        {
            "term": "Coin",
            "description": "A coin is digital cash generated via their own independent blockchain."
        },
        {
            "term": "Cold Wallet",
            "description": "Cold wallet, known also as a 'hardware wallet' or 'offline wallet', stores the user's address and private key. Since it is not connected to the Internet, it cannot be compromised."
        },
        {
            "term": "Confirmation",
            "description": "When the network has verified a blockchain transaction through the process of 'mining'. Once a transaction is successfully confirmed it cannot be reversed or double spent."
        },
        {
            "term": "Confirmation Time ",
            "description": "The elapsed time from submitting a blockchain transaction till the moment it is finally recorded in a validated block."
        },
        {
            "term": "Contract account",
            "description": "One of the two types of accounts on the Ethereum blockchain. This account is controlled only by code and has no public-private keys involved. Since it uses networks storage, creating an account has a cost. Its execution is triggered by transactions or messages received from other contracts."
        },
        {
            "term": "CPFP",
            "description": "Stands for Child Pays for Parent - a method used for an unprocessed 'stuck' transaction which has too low of a fee, and the receiver has to pay a higher fee by broadcasting a new transaction and spending UTXO from the 'stuck' transaction. This way the miners are motivated to mine the low-fee transaction ASAP."
        },
        {
            "term": "Credit",
            "description": "Used to define spending limit on requests. Credits depend on the subscription tier you have to a Crypto APIs' product."
        },
        {
            "term": "Cryptocurrency",
            "description": "A digital asset/currency which is verified by cryptography and hence is nearly impossible to counterfeit. It uses the blockchain technology and is distributed, exchanged and traded in a Peer-to-Peer network. Cryptocurrency payments and transactions are digital entries in an online database (ledger)."
        },
        {
            "term": "Cryptography",
            "description": "The study of utilizing numerical hypotheses and calculations so as to encrypt and decrypt data."
        },
        {
            "term": "Custody",
            "description": " Is also known as 'custodial service' - the holding of assets on behalf of a client. In regards to cryptocurrency, it refers to when a third party holds the private keys to a user’s funds, which would make that third party the only one who can send and receive these coins."
        }
    ],
    "D": [
        {
            "term": "DAC",
            "description": "Stands for Decentralized Autonomous Cooperative – an organization that is governed by its members and is not influenced by any centralized entity."
        },
        {
            "term": "DAO",
            "description": "Stands for Decentralized Autonomous Organization – a system that was made popular due to Ethereum, which is controlled by hard-coded rules dictating what actions a decentralized organization should take next."
        },
        {
            "term": "DApp",
            "description": "Stands for Decentralized Applications - applications that run in decentralized networks and are not controlled by any centralized entity."
        },
        {
            "term": "Dash",
            "description": "Dash is an open source cryptocurrency that forked from Bitcoin and launched in 2014. It was originally known as 'Darkcoin' and was designed to ensure user privacy and anonymity by permitting untraceable transactions. It is also a decentralized autonomous organization run by a subset of its users, which are called 'masternodes'."
        },
        {
            "term": "Dashboard",
            "description": "The interface which provides users with private and advanced access and control over their Crypto APIs subscriptions."
        },
        {
            "term": "Database",
            "description": "An organized collection of data, usually stored and accessed electronically from a computer system. Databases keep information on software/API details starting anywhere from user data, transactions, to addresses, access and history of actions."
        },
        {
            "term": "DCA",
            "description": "Stands for Dollar Cost Averaging - investing fixed amounts of e.g. USD at regular intervals of time."
        },
        {
            "term": "Dead Cat bounce",
            "description": "A brief interruption in the downtrend of an asset by a slight increase."
        },
        {
            "term": "Decentralized",
            "description": "A concept of data and network distribution where these are not governed by a single (centralized) entity (server, computer, etc.), instead there are identical copies of the information on multiple servers/computers. There is no supervisory entity in this case."
        },
        {
            "term": "Decryption",
            "description": "The process of turning indiscernible information into readable (human- or computer-) information."
        },
        {
            "term": "DeFi",
            "description": "Stands for Decentralized Finance - a group of decentralized financial applications created on top of the blockchain networks."
        },
        {
            "term": "Delisting",
            "description": "When an asset is removed from an exchange. This can be done either by an external request or a decision made by the exchange."
        },
        {
            "term": "Design Flow Attack ",
            "description": "An attack in which a user maliciously creates smart contracts, a decentralized market, etc., which usually have apparent high incentives so that users would be tricked to lock their funds there. These usually result in unfair settlements or the release of funds."
        },
        {
            "term": "DEX",
            "description": "Stands for Decentralized Exchange – exchange systems where people can legitimately access trading from their wallets without having to initially store or hold their assets."
        },
        {
            "term": "Difficulty bomb",
            "description": "An expression referring to the increased difficulty in mining in Ethereum during its migration to Proof of Stake."
        },
        {
            "term": "Digital Signature ",
            "description": "An identifier code that derives from encrypting a public key and goes along with the verification document of the sender."
        },
        {
            "term": "Distributed Ledger  ",
            "description": "Ledgers that hold data across the blockchain without the need to contain its dedicated currency. They are decentralized and don't have a central administrator."
        },
        {
            "term": "Distributed Network ",
            "description": "A network where the components of the program and data depend on multiple sources, i.e. are distributed over blocks (nodes). A decentralized network."
        },
        {
            "term": "Do Your Own Research (DYOR or DD)",
            "description": "A common expression among people knowledgeable in cryptocurrency. Reminds to always research various coins and currencies before investing. This phrase strives to counter the spreading of Internet misinformation."
        },
        {
            "term": "Dogecoin/ Doge",
            "description": "It is an altcoin and the most popular meme coin/cryptocurrency, which has the image of a Shiba Inu dog as its logo. It was launched in Dec. 2013. Its underlying technology is derived from Litecoin."
        },
        {
            "term": "DoS Attack",
            "description": "Stands for Denial of Service attack. It is a cyber attack in which the perpetrator seeks to make a machine or network resource unavailable to its intended users by temporarily or indefinitely disrupting services of a host connected to the Internet."
        },
        {
            "term": "Dust/ Bitcoin dust ",
            "description": "Bitcoin dust is the small amount of bitcoin that remains in a particular wallet or address because the monetary value is so tiny that it is below the amount of the fee required to spend the bitcoin. It makes the transaction impossible to process."
        }
    ],
    "E":[
        {
            "term": "Eclipse Attack",
            "description": "A type of network attack where the malicious intenders are the majority of peers on the network and monopolize it. This action prevents certain nodes from receiving information."
        },
        {
            "term": "Encryption",
            "description": "The process of turning coherent information into indiscernible information. This is done for security reasons related to unauthorized availability to the data."
        },
        {
            "term": "Enterprise Ethereum Alliance (EEA) ",
            "description": "An organization that empowers the Ethereum ecosystem and enables other organizations to adopt and use the Ethereum technology in their day-to-day business."
        },
        {
            "term": "Epoch",
            "description": "A time frame in Ethereum consisting of 6.4 minutes, which has 32 slots, where each slot is 12 seconds. A single block can be created for each slot. The first slot of every epoch is a checkpoint where previous blocks can become verified and finalized."
        },
        {
            "term": "ERC-20",
            "description": "The standard protocol for the issuing and implementing of tokens on the Ethereum blockchain since 2015."
        },
        {
            "term": "ERC-721",
            "description": "Represents a non-fungible token standard which allows the implementation of a standard API for such tokens within smart contracts."
        },
        {
            "term": "Ether",
            "description": "The official currency and transaction token of the Ethereum network."
        },
        {
            "term": "Ethereum (ETH)",
            "description": "Ethereum is a decentralized, open-source blockchain and the second largest in the world after Bitcoin. Still, it is the most used blockchain in the world. Ethereum was created in 2014 by programmer Vitalik Buterin. It’s currency is the Ether. Unlike Bitcoin, ETH can store and execute smart contracts."
        },
        {
            "term": "Ethereum Virtual Machine (EVM) ",
            "description": "An Ethereum Virtual Machine executes code in random algorithmic complexity and is used for smart contracts on the Ethereum blockchain. Its code is isolated, as it’s not in contact with any other processes, networks, or filesystems. An EVM allows developers to create DApps (decentralized applications)."
        },
        {
            "term": "Exchange",
            "description": "A marketplace for cryptocurrency where users can trade digital currency for other assets, e.g. generic fiat money or other digital currencies."
        },
        {
            "term": "External account/ Externally Owned Account (EOA) ",
            "description": "One of the types of accounts that Ethereum uses. External accounts are controlled by public-private key pairs and the user can send ether and messages from such an account only if they own that private key associated."
        }
    ],
    "F":[
        {
            "term": "Faucet",
            "description": "Also known as a Bitcoin faucet, refers to a type of crypto reward that originated as a way to spread awareness about cryptocurrencies as a whole. Represents an application or website which would reward free crypto coins to an IP address that connects to them."
        },
        {
            "term": "Federated blockchain ",
            "description": "Otherwise known as a Consortium blockchain, this is a partially private system consisting of a user group which has controlled access and can function across different companies."
        },
        {
            "term": "Fiat/ Fiat currency ",
            "description": "Represents money that is formally authorized by a government, such as official country currencies, e.g. USD, BGN, etc."
        },
        {
            "term": "Finality",
            "description": "The guarantee that completed cryptocurrency transactions cannot be changed, reversed, or cancelled."
        },
        {
            "term": "Flappening",
            "description": "The term used for when Litecoin surpassed Bitcoin Cash in terms of market capitalization."
        },
        {
            "term": "Flippening",
            "description": "The term to use for when Ethereum would surpass Bitcoin in terms of market capitalization."
        },
        {
            "term": "Formal verification ",
            "description": "The process of using concrete mathematical proofs to ensure specific properties of blockchain mechanisms and cryptographic algorithms."
        },
        {
            "term": "FUD",
            "description": "Stands for Fear, Uncertainty and Doubt – a marketing strategy used to spread uncertainty and fear in relation to the cryptocurrency’s whole concept, e.g. Bitcoin’s FUD on being just a bubble."
        },
        {
            "term": "Full node",
            "description": "A machine that does the complete implementation of the blockchain protocols and makes sure the transactions and blocks that go through it are actually validated."
        }
    ],
    "G":[
        {
            "term": "Gas",
            "description": "The mechanism which Ethereum has implemented for calculating the pricing and fees of smart contract operations and transactions."
        },
        {
            "term": "Gas Limit",
            "description": "The highest price a user is willing to pay for a transaction’s/smart contract’s fee."
        },
        {
            "term": "Genesis Block",
            "description": "The first block on a specific blockchain, otherwise known as Block 0 or 1."
        },
        {
            "term": "Gossip Protocol",
            "description": "A specific type of P2P communication between a computer (node) and other devices, which dictates how the information is distributed."
        },
        {
            "term": "Gwei",
            "description": "A small portion of the Ether currency. Represents one-billionth of an Ether and is especially useful when using gas in Ethereum."
        }
    ],
    "H":[
        {
            "term": "Halving",
            "description": "When a block reward of a crypto asset decreases by 50% with the purpose to reach a finite supply of this specific asset."
        },
        {
            "term": "Hard Cap",
            "description": "Regarding ICO, represents the top limit on the number of tokens that can be sold during that initial stage of funding."
        },
        {
            "term": "Hard fork",
            "description": "A hard fork alters the blockchain data in a public blockchain. Requires all nodes in a network to upgrade and agree to the new version."
        },
        {
            "term": "Hash",
            "description": "A function that converts one value to another. It converts an input of letters and numbers into an encrypted output of a fixed length. A hash is created using an algorithm essential to blockchain management in cryptocurrency."
        },
        {
            "term": "Hash rate",
            "description": "The speed at which a machine can calculate new hashes (hashes/second)."
        },
        {
            "term": "HD Wallet",
            "description": "An HD Wallet, or Hierarchical Deterministic wallet, is a digital wallet that automatically generates a hierarchical tree-like structure of private/public addresses (or keys), thereby addressing the problem of the user having to generate them on their own."
        },
        {
            "term": "HFT",
            "description": "Stands for High Frequency Trading – type of an algorithmic trading that enables the execution of large number of orders in a very short period of time."
        },
        {
            "term": "HODL",
            "description": "Stands for Hold on for Dear Life – holding on to the ownership of the asset and not selling."
        },
        {
            "term": "Hot Wallet",
            "description": "Also known as “warm wallet”, a hot wallet is at all times directly connected to the Internet. For example one that is held on a centralized exchange. Hot wallets are considered to have lower security than cold storage systems or cold wallets."
        },
        {
            "term": "HTLC",
            "description": "Stands for Hashed TimeLock Contract – a feature that creates smart contracts in cryptocurrency which can edit its channels by implementing time-bound transactions and eliminates risk."
        }
    ],
    "I":[
        {
            "term": "ICO",
            "description": "Stands for Initial Coin Offering – the stage at which the new digital coin assets are offered and sold to investors."
        },
        {
            "term": "Idempotency",
            "description": "When a specific process/operation produces the same result over and over again when called multiple times. An independent operation suffers no additional side effects on the resource."
        },
        {
            "term": "Identifier",
            "description": "Symbols used to uniquely identify a program element in the code."
        },
        {
            "term": "IEO",
            "description": "Stands for Initial Exchange Offering – the stage at which a credible intermediary is put between the coin offering team and the user in order to facilitate and reduce risky purchases."
        },
        {
            "term": "Immutability",
            "description": "The main principle behind Bitcoin and blockchain technology, which states inability to be changed."
        },
        {
            "term": "Indexing",
            "description": "A method to track the performance of assets in a standardized way."
        },
        {
            "term": "Inflationary currency/coin ",
            "description": "Refers to a currency or crypto coin which follows an “inflation model”. This means that prices rise, more of this currency is periodically created (or mined for crypto coins), its buying power decreases, and hence it becomes less valuable over time. Fiat money is inflationary, that is why $20 dollars buy you less now, than 10 years ago."
        },
        {
            "term": "Interoperability",
            "description": "The process of validating the compatibility of blockchains which allows for further usage of their features."
        },
        {
            "term": "IPFS",
            "description": "Stands for InterPlanetary File System - a protocol and P2P network, created in 2015 with the ambition to eventually replace HTTP, and is used for storing, sharing and forwarding data in a distributed file system."
        },
        {
            "term": "IPO",
            "description": "Stands for Initial Public Offering – the stage at which the private companies’ shares are offered and sold to the public for the first time."
        },
        {
            "term": "ISO",
            "description": "Stands for International Organization for Standardization. It is an international standard-setting body composed of representatives from various national organizations, which has its headquarters in Geneva, Switzerland. It was founded in 1947, and promotes worldwide industrial and commercial standards."
        },
        {
            "term": "Issuance",
            "description": "The generating of new cryptocurrency tokens and coins."
        }
    ],
    "J":[
        {
            "term": "Jager",
            "description": "BNB's smallest denomination."
        }
    ],
    "K":[
        {
            "term": "KYC (Know Your Customer) ",
            "description": "A process during which a business must verify the identity and background information (address, financials, etc.) of their customers."
        }
    ],
    "L":[
        {
            "term": "Latency",
            "description": "The amount of time that takes from the submission of the transaction until it is confirmed and accepted to the blockchain."
        },
        {
            "term": "Layer 2",
            "description": "Refers to a second layer protocol that is built on top of a blockchain with the purpose of increasing transaction speed and scalability."
        },
        {
            "term": "Ledger",
            "description": "A physical or digital file where payments and transactions are tracked and recorded."
        },
        {
            "term": "Lightning Network ",
            "description": "The second layer payment protocol executed on top of the blockchain-based cryptos. It allows for transactions' speed increase within nodes and aims to solve scalability problems."
        },
        {
            "term": "Linux",
            "description": "An open-source Unix-based operating system based on the Linux kernel."
        },
        {
            "term": "Litecoin",
            "description": "Litecoin was an early Bitcoin altcoin that started in October 2011. It is almost identical to Bitcoin but features faster transaction confirmation times and improved storage efficiency."
        }
    ],
    "M":[
        {
            "term": "Mainnet",
            "description": "A blockchain protocol that offers users the possibility to send and receive digital assets. Unlike Testnet, Mainnet is fully developed and deployed for the end-user, simply - the main network."
        },
        {
            "term": "Maker",
            "description": "A user that places an order which doesn’t get traded right away and as such, it is maintained in the order book."
        },
        {
            "term": "Market Cap",
            "description": "Short for Market Capitalization and refers to the total value held in a particular industry, market, company, or asset. For Bitcoin or Ethereum, the total market cap is the reflection of the current existing supply times the market price."
        },
        {
            "term": "Masternode",
            "description": "Represents a full node enabling the core consensus functions when running a blockchain and requires an initial 'stake' of tokens in order to operate."
        },
        {
            "term": "Maximum Supply",
            "description": "Represents the maximum number of all coins and tokens that will ever be created for a specific cryptocurrency."
        },
        {
            "term": "Mempool",
            "description": "The ability of a node to keep track of unconfirmed transactions that have not yet been added to a block."
        },
        {
            "term": "Merged Mining",
            "description": "The process of merging two or more mining processes without putting the overall performance at risk."
        },
        {
            "term": "Merkle Tree",
            "description": "A type of data structure that contains hash functions and facilitates the organization and structure when dealing with lots of data."
        },
        {
            "term": "Metadata",
            "description": "Data that includes and describes other data, or data about data."
        },
        {
            "term": "Mining",
            "description": "The process of validating Blockchain transactions by using computing power to solve “puzzles”. Mining receives coins as rewards for mined transactions."
        },
        {
            "term": "Mnemonic",
            "description": "Defined as a secret group of words that represent a wallet. When used in a sequence they allow access to the cryptocurrencies stored within."
        },
        {
            "term": "Moon",
            "description": "An expressed used for when a cryptocurrency is in a continuous and strong positive trend."
        },
        {
            "term": "multi-signature (multisig) ",
            "description": "The addresses that enable several parties to need more than one key to authorize the transaction. These addresses have much higher resistance to theft."
        }
    ],
    "N":[
        {
            "term": "NFT",
            "description": "Stands for Non-fungible token – a token which the user can’t substitute and is useful for unique asset representation."
        },
        {
            "term": "Node",
            "description": "A unit of the blockchain that enables communication between other units for security and integrity purposes."
        },
        {
            "term": "Nonce",
            "description": "A single-use random string or number generated for the purpose of verification in order to prevent replaying past transactions."
        }
    ],
    "O":[
        {
            "term": "Off-chain",
            "description": "A transaction that occurs outside of a blockchain. Such transactions have zero/low cost."
        },
        {
            "term": "Omni layer",
            "description": "Omni is a platform for creating and trading custom digital assets and currencies. It is built on top of Bitcoin."
        },
        {
            "term": "Orphan block",
            "description": "A block with an unknown parent block created during older versions of Bitcoin Core."
        }
    ],
    "P":[
        {
            "term": "P2PK",
            "description": "Stands for Pay to Public Key. A transaction type much similar to P2PKH but does not conceal the public key, it is rather displayed in the transaction details."
        },
        {
            "term": "P2PKH",
            "description": "Stands for Pay to Public Key Hash. Represents the most common transaction script used when a certain amount of Bitcoin from one address to another is made. The sender must supply a valid signature and public key which is then matched to the public key hash to determine if the funds can be spent. The public key is concealed for security reasons."
        },
        {
            "term": "P2SH",
            "description": "Stands for Pay To Script Hash. Represents a type of transaction whose inputs are locked with a ScriptPubKey. The Bitcoin can be spent depending on the script and its transaction hash."
        },
        {
            "term": "P2WPKH",
            "description": "Stands for Pay To Witness Public Key Hash. Much like P2PKH but it locks the Bitcoin to a SegWit address. Validation is done in a part of the transaction called 'witness', which must contain two items and its public key's HASH160 has to be equal to the one in the witness program."
        },
        {
            "term": "P2WSH",
            "description": "Stands for Pay to Witness Script Hash. It is a type of transaction similar to P2SH but it uses SegWit. It locks bitcoin to the hash of a script. The transaction sender has to first present all required signatures and the script, called a RedeemScript, in order to spend the bitcoin."
        },
        {
            "term": "Paper Wallet",
            "description": "A physical print of the digital asset’s address with the private keys in accordance."
        },
        {
            "term": "Peer-to-Peer (P2P)",
            "description": "A distributed application architecture that partitions tasks or workloads between equally privileged peers, that are said to form a peer-to-peer network of nodes."
        },
        {
            "term": "PoS",
            "description": "Stands for Proof of Stake – an algorithm that doesn’t need a lot of powering energy, where the more digital assets are staked, the higher is the probability that the block will be picked for deciding on the consensus."
        },
        {
            "term": "Post-quantum",
            "description": "In cryptography, represents innovative cryptographic approaches that can be implemented using today’s computers but will be imperviable to attacks from future quantum ones."
        },
        {
            "term": "PoW (Proof of Work) ",
            "description": "Stands for Proof of Work – an algorithm where work is considered to be the activity done in mining which determines the amount of the reward the miner receives."
        },
        {
            "term": "Private blockchain  ",
            "description": "A Private Blockchain allows only authorized entities to send or receive transactions within the network. No one can write/read or audit the records stored on the private blockchain unless someone has permission to do so."
        },
        {
            "term": "Private key",
            "description": "A text string used for enabling security in a block chain by going through encryption and decryption processes. It is also used for having wallets and transactions accessible on the blockchain."
        },
        {
            "term": "Progressive web application",
            "description": "A web app developed using modern technologies which meets certain web standards."
        },
        {
            "term": "Proof of Authority",
            "description": "A consensus mechanism used in private blockchains to grant a single private key the authority to generate all of the blocks or validate transactions Protocol"
        },
        {
            "term": "Public blockchain",
            "description": "Public Blockchain is an open network which allows anyone from the world to send or receive transactions."
        }
    ],
    "Q":[
        {
            "term": "Quantum computing",
            "description": "Represents the development of computer technology based on the principles of quantum theory. These explain why energy and material behave the way they do on atomic and subatomic levels."
        }
    ],
    "R":[
        {
            "term": "Race Attack",
            "description": "An occurrence when two transactions are created with the same amount at the same time so that both funds can be spent."
        },
        {
            "term": "Rate Limits",
            "description": "A strategy for limiting network traffic. It puts a cap on how often someone can make a request to the API within a certain timeframe."
        },
        {
            "term": "RBF",
            "description": "Stands for Replace by Fee - refers to a method where an unprocessed 'stuck' transaction can be 'fixed' by changing its fee so that it gets mined and accepted to a block."
        },
        {
            "term": "Redeem Script",
            "description": "Represents the script used to unlock BTC that has been sent to a P2SH or P2WSH address."
        },
        {
            "term": "Rinkeby",
            "description": "A main network of Ethereum used for testing. It uses Proof of Authority for which you need to prove your existence in order to retrieve ethers from a faucet."
        },
        {
            "term":  "Ropsten",
            "description": "A main network of Ethereum used for testing. It uses Proof of Work consensus algorithm, meaning that nodes are in charge of maintaining the network."
        }
    ],
    "S":[
        {
            "term": "Satoshi",
            "description": "The smallest unit in Bitcoin named after Satoshi Nakamoto, the creator of Bitcoin and blockchain. It equals 0.00000001 BTC."
        },
        {
            "term": "Satoshi Nakamoto",
            "description": "The pseudonym of the person/people who created Bitcoin, whose real name/names are not known."
        },
        {
            "term": "Script Witness ",
            "description": "It contains signatures and public keys, which can together unlock bitcoins from SegWit transactions. Each SegWIt input contains its own Script Witness. Not to be confused with Witness Script."
        },
        {
            "term": "ScriptPubKey",
            "description": "Represents a script which controls how bitcoins can be spent. It locks the bitcoin until it can be unlocked by providing an answer, depending on the type of the transaction."
        },
        {
            "term": "ScriptSig",
            "description": "Represents a specific input script that unlocks funds from the specific crypto transaction output. A ScriptSig includes one or more signatures and additional data used for spending according to conditions that have been outlined in the output."
        },
        {
            "term": "Security Token ",
            "description": "A device which is used to grant access to a restricted resource and is given to investors after participating in an ICO."
        },
        {
            "term": "Seed phrase",
            "description": "Represents a word collection that can be used to access a cryptocurrency wallet."
        },
        {
            "term": "Segregated Witness (SegWit)",
            "description": "A process which enables a higher number of transactions to be part of a block by separating them from coin-bitcoin transactions."
        },
        {
            "term": "SegWit Wallets",
            "description": "Stands for Segregated Witness Wallets – a service that is executed on the Bitcoin blockchain and is concerned with separating particular transaction signature information. It can either be nested or native."
        },
        {
            "term": "Selfish Mining ",
            "description": "A strategy where blocks are withheld and released which could give the miner competitive advantage over the network."
        },
        {
            "term": "Sharding",
            "description": "Dividing the network into several smaller component networks that can process transactions in parallel."
        },
        {
            "term": "Simplified Payment Verification (SPV) ",
            "description": "Represents a tool/software that can confirm that a cryptocurrency transaction has been added to the blockchain without the need to actually download the entire blockchain."
        },
        {
            "term": "Smart contract ",
            "description": "A self-executing contract with the terms of the agreement between buyer and seller being directly written into lines of code."
        },
        {
            "term": "Stablecoin",
            "description": "A digital asset that is intended to keep its stable value and not go through changes."
        },
        {
            "term": "Solidity",
            "description": "A programming language used in the Ethereum blockchain for smart contract creation."
        }
    ],
    "T":[
        {
            "term": "Taker",
            "description": "Someone who places an order which gets to be instantly matched with an existing order in the order book."
        },
        {
            "term": "Testnet",
            "description": "A type of software used by cryptocurrency with the sole purpose of testing changes while not affecting the overall functioning of the main blockchain."
        },
        {
            "term": "Threshold Signatures Scheme (TSS) ",
            "description": "Threshold Signatures Scheme (TSS) removes the burden of the single atomic private key and splits the responsibility between multiple parties. Each of the parties generates its own secret and uses this secret to distributively sign a transaction without revealing the secret to the other parties."
        },
        {
            "term": "Token",
            "description": "The representation of a digital asset built on an existing blockchain. Tokens are unique, secure, and instantly transferable."
        },
        {
            "term": "Token lockup",
            "description": "The time period during which tokens or coins cannot be traded or transferred."
        },
        {
            "term": "Transaction block",
            "description": "A collection of transactions on a blockchain network, gathered into a set, i.e. block, that can then be first hashed and after that added to the blockchain."
        },
        {
            "term": "Transaction Fee",
            "description": "How much a transaction would cost, or the charge a specific business has to pay every time it processes a customer's electronic payment."
        },
        {
            "term": "Transaction ID (TXID) ",
            "description": "Otherwise known as Transaction ID – the users use it to recognize and reference transactions in the network."
        },
        {
            "term": "Transaction per second (TPS)",
            "description": "The quantity of transactions that the processing power of a blockchain can operate each second."
        },
        {
            "term": "Turing complete",
            "description": "A system that represents the automation of solving any kind of problem given enough resources."
        }
    ],
    "U":[
        {
            "term": "UI (User Interface) ",
            "description": "The interface and its layout, where a user operates. The connection between the user and software."
        },
        {
            "term": "Uncle/ Uncle block",
            "description": "Stale blocks that contribute to the security of the main chain."
        },
        {
            "term": "Unit of Account",
            "description": "A primary measurement of money, both fiat and cryptocurrencies."
        },
        {
            "term": "Utility token",
            "description": "A token aimed at accessing a specific product and also used in the ICOs processes."
        },
        {
            "term": "UTXO",
            "description": "Stands for Unspent Transaction Output – a method of spending from the leftover outputs of a previous transaction so that new outputs are created for future transactions. The excess coins are sent to a self-controlled address."
        }
    ],
    "V":[
        {
            "term": "Verification code",
            "description": "The code sent from one device to another with the purpose of verifying a user's login. Used for 2FA (Two-Factor Authentication)."
        },
        {
            "term": "Vladimir Club",
            "description": "The concept of being a member as long as the user has 1/10,000th of all the mined Bitcoin."
        },
        {
            "term": "Volatility",
            "description": "The pace with which an asset's price changes over time."
        },
        {
            "term": "Volume",
            "description": "Otherwise known as trading volume, represents the total number of units that have been traded over a certain period of time."
        }
    ],
    "W":[
        {
            "term": "Wallet",
            "description": "In blockchain, a Wallet is a digital wallet that allows users to store and manage their cryptocurrency coins."
        },
        {
            "term": "Weak Subjectivity ",
            "description": "The necessity of a particular node to rely on the other nodes when defining the current state of the system. It is a prerequisite on PoS."
        },
        {
            "term": "Wei",
            "description": "The smallest denomination of Ether, the digital coin on the Ethereum blockchain."
        },
        {
            "term": "Weight",
            "description": "A measurement used to compare the size of different Bitcoin transactions to each other in proportion to the consensus-enforced maximum block size limit."
        },
        {
            "term": "WETH",
            "description": "Stands for Wrapped Ether - allows users to trade Ether to ERC-20 tokens."
        },
        {
            "term": "Whale",
            "description": "Entities that own a high number of digital currencies."
        },
        {
            "term": "White Paper",
            "description": "In blockchain the term white paper refers to an informational document written with the purpose to persuade people to support a service, idea or product. White papers explain the purpose and technology of blockchain."
        },
        {
            "term": "Whitelist",
            "description": "A list with permitted and trusted applications, users, devices, etc."
        },
        {
            "term": "Witness",
            "description": "Represents the transaction signatures in SegWit."
        },
        {
            "term": "Witness Script",
            "description": "The script that defines the requirements of the P2WSH output. Being located in the Witness field, this makes P2WSH inputs cheaper than P2SH inputs. Not to be confused with Script Witness."
        },
        {
            "term": "Witness Field",
            "description": "Is comprised of all Script Witnesses."
        }
    ],
    "X":[
        {
            "term": "xPub",
            "description": "Stands for Extended public Key – key containing information on public keys in cryptocurrencies’ transactions which permits complete read-only view to a particular wallet regarding locations, transactions and balances compatible with Legacy wallets."
        },
        {
            "term": "XRP",
            "description": "The official blockchain and cryptocurrency coin created by the company Ripple. XRP is the third-largest cryptocurrency by market cap, following Bitcoin and Ethereum."
        }
    ],
    "Y":[
        {
            "term": "yPub",
            "description": "A key containing information on public keys in cryptocurrencies’ transactions which permits complete read-only view to a particular wallet regarding locations, transactions and balances, compatible with Nested SegWit Wallets."
        }
    ],
    "Z":[
        {
            "term": "Zero-Knowledge Proofs ",
            "description": "Technology used to verify transactions happening on a blockchain without posing any threat to the privacy of the wallets or the data which is being exchanged."
        },
        {
            "term": "Zilliqa",
            "description": "A public blockchain platform designed to process thousands of transactions per second. Through the use of sharding Zilliqa's transaction rate actually increases as the mining network expands."
        },
        {
            "term": "Zk-Snarks",
            "description": "Stands for Zero-Knowledge Succinct Non-Interactive Argument of Knowledge, which is an approach to Zero-Knowledge Proofs."
        },
        {
            "term": "zPub",
            "description": "The newest Public Extended Key. Just like yPub, zPub follows the BIP49 standard, but the address type is P2WPKH. It is for native compatible SegWit wallets."
        }
    ]
} 